app/Models/M_User.php

SELECT *
FROM `tbl_user`
WHERE `id_user` = 'USR001'
ORDER BY `id_user` ASC
---
    public function getDataUser($where = false)
    {
        if ($where === false) {
            $builder = $this->db->table($this->table);
            $builder->select('*');
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();
        } else {
            $builder = $this->db->table($this->table);
            $builder->select('*');
            $builder->where($where);
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();